Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Executando terraform plan


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_autoscaling_attachment.asg_attachment_atlantis has been deleted
- resource "aws_autoscaling_attachment" "asg_attachment_atlantis" {
      - alb_target_group_arn   = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/3efdda83734360cb" -> null
      - autoscaling_group_name = "atlantis_ecs" -> null
      - id                     = "atlantis_ecs-20220318191059940600000001" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment_atlantis will be created
+ resource "aws_autoscaling_attachment" "asg_attachment_atlantis" {
      + alb_target_group_arn   = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/3efdda83734360cb"
      + autoscaling_group_name = "atlantis_ecs"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.atlantis_ecs will be updated in-place
~ resource "aws_autoscaling_group" "atlantis_ecs" {
        id                        = "atlantis_ecs"
      ~ max_size                  = 1 -> 2
      ~ min_size                  = 1 -> 0
        name                      = "atlantis_ecs"
        # (21 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_launch_configuration.ubuntu_v3 must be replaced
-/+ resource "aws_launch_configuration" "ubuntu_v3" {
      ~ arn                              = "arn:aws:autoscaling:us-east-2:398963803929:launchConfiguration:7372ba46-d897-4ffe-bc95-70a5f05b7923:launchConfigurationName/atlantis_ecs_v3" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "atlantis_ecs_v3" -> (known after apply)
        name                             = "atlantis_ecs_v3"
      + name_prefix                      = (known after apply)
      ~ user_data                        = "1ef7f7601cedd8e0a4847cab16f99ffad6a45e8f" -> "bdb1f81aad6e1e3c5c7fce7a79df8628d624636f" # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (6 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://66992d035d8e:4141/lock?id=Matheus-SCosta%252FATLANTIS-ECS%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 1 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
